; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	image2 - mode
	infrared3 - mode
	infrared0 - mode
	thermograph4 - mode
	thermograph1 - mode
	Star6 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star4 - direction
	Star3 - direction
	Star5 - direction
	Star0 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph4)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared3)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument6 thermograph4)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(supports instrument7 thermograph4)
	(supports instrument7 image2)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
	(supports instrument8 image2)
	(supports instrument8 infrared3)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 Star4)
	(supports instrument9 infrared0)
	(supports instrument9 thermograph4)
	(supports instrument9 image2)
	(calibration_target instrument9 Star0)
	(calibration_target instrument9 Star5)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star3)
)
(:goal (and
	(pointing satellite2 Phenomenon12)
	(pointing satellite4 Phenomenon7)
	(pointing satellite5 Phenomenon11)
	(have_image Phenomenon7 image2)
	(have_image Star8 thermograph1)
	(have_image Planet9 thermograph1)
	(have_image Planet10 infrared3)
	(have_image Phenomenon11 infrared3)
	(have_image Phenomenon12 thermograph1)
))

)

; plan
1. (switch_on instrument8 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument8)
   goals met: 0 of 9
2. (calibrate satellite5 instrument8 star3)
   added: (calibrated instrument8)
   goals met: 0 of 9
3. (turn_to satellite5 planet10 star3)
   deleted: (pointing satellite5 star3)
   added: (pointing satellite5 planet10)
   goals met: 0 of 9
4. (take_image satellite5 planet10 instrument8 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 1 of 9
5. (turn_to satellite5 phenomenon7 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 phenomenon7)
   goals met: 1 of 9
6. (take_image satellite5 phenomenon7 instrument8 image2)
   added: (have_image phenomenon7 image2)
   goals met: 2 of 9
7. (turn_to satellite5 phenomenon12 phenomenon7)
   deleted: (pointing satellite5 phenomenon7)
   added: (pointing satellite5 phenomenon12)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon12 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon12)
   goals met: 3 of 9
9. (take_image satellite5 phenomenon12 instrument8 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 4 of 9
10. (turn_to satellite4 phenomenon7 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 phenomenon7)
   goals met: 5 of 9
11. (turn_to satellite5 planet9 phenomenon12)
   deleted: (pointing satellite5 phenomenon12)
   added: (pointing satellite5 planet9)
   goals met: 5 of 9
12. (take_image satellite5 planet9 instrument8 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 6 of 9
13. (turn_to satellite5 star8 planet9)
   deleted: (pointing satellite5 planet9)
   added: (pointing satellite5 star8)
   goals met: 6 of 9
14. (take_image satellite5 star8 instrument8 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 7 of 9
15. (turn_to satellite5 phenomenon11 star8)
   deleted: (pointing satellite5 star8)
   added: (pointing satellite5 phenomenon11)
   goals met: 8 of 9
16. (take_image satellite5 phenomenon11 instrument8 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 9 of 9
